:PROPERTIES:
:ID:       738e6e8c-df28-449c-a33f-bcd7470e7db3
:END:
#+title: Computer Engineering
#+filetags: :@computerEngineering:@boat:

[[id:b2840f43-a37a-4b95-a50d-d2dd18ce2129][GTI]]


* Computer Engineering                                 :@computerEngineering:

** Time Tracking

*** STM32 Blue Pill vs Black Pill Microcontroller Boards
:LOGBOOK:
CLOCK: [2026-02-01 Sun 19:25]--[2026-02-01 Sun 19:38] =>  0:13
:END:

*** 4N35 Chip
:LOGBOOK:
CLOCK: [2026-02-06 Fri 18:27]--[2026-02-06 Fri 18:33] =>  0:06
:END:

[[id:ed5c083b-da95-4906-b601-25a57a847b74][4N35 Optocoupler]]

*** 74HC595
:LOGBOOK:
CLOCK: [2026-02-06 Fri 18:33]--[2026-02-06 Fri 18:59] =>  0:26
:END:

 * [[id:4f2783a6-6163-481a-8e70-4487f27b595e][SIPO Shift Register]]
 * [[id:1ab99acd-2778-4668-990a-e5bb4b39a35d][Serial Input]]
 * [[id:9c942c93-f964-4daa-9ed4-d56e0da115b9][Shift Mode]]
 * [[id:368f2e2d-bdb3-4d29-b05b-324702792c63][Clock Signal]]
 * [[id:4f2783a6-6163-481a-8e70-4487f27b595e][Shift Register]]
 * [[id:cd117960-5d0c-44a9-983d-7f93c4045194][Data Buffering]]
 * [[id:d15e649d-4d9c-43ab-a5bf-0ea3a49196d1][Address Decoding]]
 * [[id:653f42f5-7331-46df-9b53-9f31356c360b][Control Systems]]
 * [[id:1ceebdce-8e6d-4dcc-97de-15da3dddee8c][D-Type Flip Flops]]
 * Daisychaining
 * Negative Logic

*** flip-flop
:LOGBOOK:
CLOCK: [2026-02-06 Fri 18:59]--[2026-02-06 Fri 19:00] =>  0:01
:END:

*** D-latch
:LOGBOOK:
CLOCK: [2026-02-06 Fri 19:00]--[2026-02-06 Fri 19:00] =>  0:00
:END:

*** S-R latch
:LOGBOOK:
CLOCK: [2026-02-06 Fri 19:00]--[2026-02-06 Fri 19:01] =>  0:01
:END:

*** Logic Gates
:LOGBOOK:
CLOCK: [2026-02-06 Fri 19:01]--[2026-02-06 Fri 20:37] =>  1:36
:END:

 * Buffers
